app/controllers/backoffice/admins_controller.rb

  def create
    @admin = Admin.new(params_admin)
    if @admin.save
---
INSERT INTO `admins` (`name`, `email`, `encrypted_password`, `created_at`, `updated_at`) VALUES ('Henrique', 'henrique@henrique.com', '$2a$11$/Q3260goGiHbuBvbKvCsxurHErU3hjosxC67iaTp5cULrPUbYq7M6', '2017-01-16 19:12:44', '2017-01-16 19:12:44')

  def update
    if @admin.update(params_admin)
---
UPDATE `admins` SET `name` = 'Alberto Shiraishi', `email` = 'alberto@alberto.com', `encrypted_password` = '$2a$11$OU9Tegfa51MM0BdeCQJd6e3PloT4WIgN/ZUwy9PLS2AUJm3dhYxii', `updated_at` = '2017-01-17 01:32:59' WHERE `admins`.`id` = 2

  def destroy
    admin_name = @admin.name
    if @admin.destroy
---
DELETE FROM `admins` WHERE `admins`.`id` = 2

  def set_admin
    @admin = Admin.find(params[:id])
---
SELECT  `admins`.* FROM `admins` WHERE `admins`.`id` = 1  ORDER BY `admins`.`id` ASC LIMIT 1