app/controllers/backoffice/members_controller.rb

  def index
    @members = Member.all
---
SELECT `members`.* FROM `members`

  def create
    @member = Member.new(params_member)
    if @member.save
---
INSERT INTO `members` (`email`, `encrypted_password`, `type_member`, `category`, `created_at`, `updated_at`) VALUES ('julia@julia.com', '$2a$11$Q6DrTu1T6meI/t6cHg4U4O2XOJKhflD48KFA4EAAC.H9/D3FTk49.', 'Cliente', 'AAA', '2017-01-17 00:22:20', '2017-01-17 00:22:20')

  def update
    if @member.update(params_member)
---
UPDATE `members` SET `encrypted_password` = '$2a$11$HnqyKChfEG6PPFLvwEmEDOJmbgZ/e6MqeWtV10Zs2SoNr99/0TARa', `type_member` = 'Cliente', `category` = 'BBB', `updated_at` = '2017-01-17 02:48:27' WHERE `members`.`id` = 34

  def destroy
    authorize @member
    member_email = @member.email
    if @member.destroy
---
DELETE FROM `members` WHERE `members`.`id` = 2

  def set_member
    @member = Member.find(params[:id])
---
SELECT  `members`.* FROM `members` WHERE `members`.`id` = 33 LIMIT 1