app/controllers/backoffice/products_controller.rb

  def create
    @product = Product.new(params_product)
    if @product.save
---
INSERT INTO `products` (`name`, `version`, `link`, `category`, `created_at`, `updated_at`) VALUES ('Teste', '1.1.1', 'slçdkfdsçlkfçdslkf', 'AAAA', '2017-01-16 21:17:33', '2017-01-16 21:17:33')

  def update
    if @product.update(params_product)
---
UPDATE `products` SET `name` = 'LiHead BackOffice', `version` = '1.1.1', `updated_at` = '2017-01-16 23:17:59' WHERE `products`.`id` = 21

  def destroy
    product_name = @product.name
    if @product.destroy
---
DELETE FROM `products` WHERE `products`.`id` = 3